export const MOVIES_URL = "https://api.nomoreparties.co/";

export const errorMessages = {
  reg: "При регистрации пользователя произошла ошибка",
  auth: "При авторизации произошла ошибка. Переданный токен некорректен.",
  err: "Вы ввели неправильный логин или пароль.",
  conf: "Пользователь с таким email уже существует.",
  prof: "При обновлении профиля произошла ошибка.",
  mov: "Ничего не найдено",
  default: "Во время запроса произошла ошибка. Возможно, проблема с соединением или сервер недоступен. Подождите немного и попробуйте ещё раз",
};

export const buttonMessage = "Для поиска введите слово и нажмите синюю кнопку со стрелкой";
